In [10]:
import pandas as pd
import numpy as np

df = pd.read_csv('/content/DisneylandReviews.csv',encoding='latin1')
df

       Review_ID  ...               Branch
0      670772142  ...  Disneyland_HongKong
1      670682799  ...  Disneyland_HongKong
2      670623270  ...  Disneyland_HongKong
3      670607911  ...  Disneyland_HongKong
4      670607296  ...  Disneyland_HongKong
...          ...  ...                  ...
42651    1765031  ...     Disneyland_Paris
42652    1659553  ...     Disneyland_Paris
42653    1645894  ...     Disneyland_Paris
42654    1618637  ...     Disneyland_Paris
42655    1536786  ...     Disneyland_Paris

[42656 rows x 6 columns]

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42656 entries, 0 to 42655
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Review_ID          42656 non-null  int64
 1   Rating             42656 non-null  int64
 2   Year_Month         42656 non-null  object
 3   Reviewer_Location  42656 non-null  object
 4   Review_Text        42656 non-null  object
 5   Branch             42656 non-null  object
dtypes: int64(2), object(4)
memory usage: 2.0+ MB

In [12]:
df.isnull().sum()

Review_ID            0
Rating               0
Year_Month           0
Reviewer_Location    0
Review_Text          0
Branch               0
dtype: int64

In [15]:
df = df.drop(columns = ['Review_ID', 'Year_Month'])
df

       Rating  ...               Branch
0           4  ...  Disneyland_HongKong
1           4  ...  Disneyland_HongKong
2           4  ...  Disneyland_HongKong
3           4  ...  Disneyland_HongKong
4           4  ...  Disneyland_HongKong
...       ...  ...                  ...
42651       5  ...     Disneyland_Paris
42652       5  ...     Disneyland_Paris
42653       5  ...     Disneyland_Paris
42654       4  ...     Disneyland_Paris
42655       4  ...     Disneyland_Paris

[42656 rows x 4 columns]

In [18]:
df['Reviewer_Location'].unique()

array(['Australia', 'Philippines', 'United Arab Emirates',
       'United Kingdom', 'Singapore', 'India', 'Malaysia',
       'United States', 'Canada', 'Myanmar (Burma)', 'Hong Kong', 'China',
       'Indonesia', 'Qatar', 'New Zealand', 'Sri Lanka', 'Uganda',
       'Thailand', 'Austria', 'South Africa', 'Saudi Arabia', 'Japan',
       'Israel', 'South Korea', 'Turkey', 'Macau', 'Egypt', 'Mexico',
       'Mauritius', 'Sweden', 'Brazil', 'Kenya', 'Vietnam', 'Portugal',
       'Cambodia', 'Zambia', 'Croatia', 'France', 'Taiwan', 'Oman',
       'Colombia', 'Norway', 'Kuwait', 'Netherlands', 'Barbados',
       'Finland', 'Bosnia and Herzegovina', 'Brunei', 'Bahrain',
       'Maldives', 'Ireland', 'Russia', 'Romania',
       'Northern Mariana Islands', 'Germany', 'Chile', 'Isle of Man',
       'Pakistan', 'Ukraine', 'Greece', 'Switzerland', 'Spain', 'Estonia',
       "CÃ´te d'Ivoire", 'Guam', 'Bangladesh', 'Belgium', 'Italy',
       'Botswana', 'Denmark', 'Argentina', 'Peru', 'Lithuania', 'Iran',
       'Mali', 'Uruguay', 'Mongolia', 'Zimbabwe', 'Seychelles',
       'Puerto Rico', 'Hungary', 'Fiji', 'Nepal', 'Jordan', 'Cyprus',
       'Venezuela', 'Dominican Republic', 'Czechia', 'Bulgaria', 'Ghana',
       'Ethiopia', 'The Bahamas', 'Serbia', 'Montenegro', 'Guatemala',
       'Kazakhstan', 'Poland', 'Vanuatu', 'Laos', 'CuraÃ§ao',
       'Falkland Islands (Islas Malvinas)', 'Andorra', 'Haiti',
       'Costa Rica', 'Nigeria', 'Jersey', 'Solomon Islands', 'Mozambique',
       'Cook Islands', 'South Sudan', 'Gibraltar', 'Trinidad and Tobago',
       'Afghanistan', 'Timor-Leste', 'Luxembourg', 'Rwanda', 'Tanzania',
       'Lebanon', 'Ecuador', 'Turks and Caicos Islands', 'Malta',
       'U.S. Virgin Islands', 'Slovakia', 'Iceland', 'Aruba',
       'French Polynesia', 'Tunisia', 'Armenia', 'Panama', 'Namibia',
       'Cuba', 'Honduras', 'Nicaragua', 'Bolivia', 'Papua New Guinea',
       'Iraq', 'Caribbean Netherlands', 'Morocco', 'Jamaica',
       'Cayman Islands', 'North Macedonia', 'Albania',
       'Antigua and Barbuda', 'Uzbekistan', 'Azerbaijan', 'Latvia',
       'Suriname', 'Algeria', 'Grenada', 'Malawi', 'Monaco', 'Guernsey',
       'Georgia', 'Moldova', 'Senegal', 'Libya', 'Madagascar',
       'Democratic Republic of the Congo', 'El Salvador', 'Slovenia',
       'Sudan', 'Ã…land Islands'], dtype=object)

In [17]:
df['Branch'].unique()

array(['Disneyland_HongKong', 'Disneyland_California', 'Disneyland_Paris'],
      dtype=object)